import type * as React from 'react'
import { Link } from 'react-router'
import { DocumentationLayout } from '../../DocumentationLayout'

const scripts: readonly string[] = []
const Content: React.FC = () => {
  return (
    <div className="middle">
      <div className="left_block">
        <div className="menu">
          {'\n\t\t'}
          <ul className="menu">
            <li className="level1">
              <Link to="/" title="Главная страница">
                {'Главная'}
              </Link>
            </li>
            {'\n'}
            <li className="level1">
              <Link to="/about.html" title="О компании">
                {'О компании'}
              </Link>
            </li>
            {'\n'}
            <li className="level1">
              <Link to="/nashi-proekty.html" title="Наши проекты">
                {'Наши проекты'}
              </Link>
            </li>
            {'\n'}
            <li className="level1">
              <Link to="/news.html" title="Новости">
                {'Новости'}
              </Link>
            </li>
            {'\n'}
            <li className="level1">
              <Link to="/services.html" title="Услуги">
                {'Услуги'}
              </Link>
            </li>
            {'\n'}
            <li className="level1">
              <Link to="/portfolio.html" title="Портфолио">
                {'Портфолио'}
              </Link>
            </li>
            {'\n'}
            <li className="level1">
              <Link to="/contacts.html" title="Контактная информация">
                {'Контактная информация'}
              </Link>
            </li>
            {'\n'}
            <li className="last level1 active">
              <Link to="/documentation.html" title="Документация">
                {'Документация'}
              </Link>
              <ul>
                <li className="level2">
                  <Link to="/documentation/extjs.html" title="ExtJS">
                    {'ExtJS'}
                  </Link>
                </li>
                {'\n'}
                <li className="last level2 active">
                  <Link to="/documentation/modx.html" title="CMS/CMF MODX">
                    {'CMS/CMF MODX'}
                  </Link>
                  <ul>
                    <li className="level3 active">
                      <Link
                        to="/documentation/modx/modx-revolution.html"
                        title="MODx Revolution"
                      >
                        {'MODx Revolution'}
                      </Link>
                      <ul>
                        <li className="level4 active self">
                          <Link
                            to="/documentation/modx/modx-revolution/modx-revolution-po-shagam.html"
                            title="MODx Revolution по шагам"
                          >
                            {'MODx Revolution по шагам'}
                          </Link>
                        </li>
                        {'\n'}
                        <li className="level4">
                          <Link
                            to="/documentation/modx/modx-revolution/modx-revolution-ustanovka.html"
                            title="MODx Revolution Установка "
                          >
                            {'MODx Revolution Установка '}
                          </Link>
                        </li>
                        {'\n'}
                        <li className="level4">
                          <Link
                            to="/documentation/modx/modx-revolution/modx-revolution-fajlovaya-model.html"
                            title="MODx Revolution файловая модель"
                          >
                            {'MODx Revolution файловая модель'}
                          </Link>
                        </li>
                        {'\n'}
                        <li className="level4">
                          <Link
                            to="/documentation/modx/modx-revolution/ustanovka-dopolnitelnyh-paketov-na-modx-revolution.html"
                            title="Установка дополнительных пакетов на MODx Revolution"
                          >
                            {
                              'Установка дополнительных пакетов на MODx Revolution'
                            }
                          </Link>
                        </li>
                        {'\n'}
                        <li className="level4">
                          <Link
                            to="/documentation/modx/modx-revolution/modx-revolution-optimizatsiya-kesh.html"
                            title="MODx Revolution Оптимизация КЭШ"
                          >
                            {'MODx Revolution Оптимизация КЭШ'}
                          </Link>
                        </li>
                        {'\n'}
                        <li className="level4">
                          <Link
                            to="/documentation/modx/modx-revolution/modx-revolution-nastrojki-bezopasnosti.html"
                            title="MODx Revolution настройки безопасности"
                          >
                            {'MODx Revolution настройки безопасности'}
                          </Link>
                        </li>
                        {'\n'}
                        <li className="level4">
                          <Link
                            to="/documentation/modx/modx-revolution/xpdo.html"
                            title="xPDO"
                          >
                            {'xPDO'}
                          </Link>
                        </li>
                        {'\n'}
                        <li className="level4">
                          <Link
                            to="/documentation/modx/modx-revolution/xpdo-urok-1.-getobject.html"
                            title="xPDO Урок 1. GetObject()"
                          >
                            {'xPDO Урок 1. GetObject()'}
                          </Link>
                        </li>
                        {'\n'}
                        <li className="level4">
                          <Link
                            to="/documentation/modx/modx-revolution/xpdo-urok-2.-getcollection.html"
                            title="xPDO Урок 2. GetCollection()"
                          >
                            {'xPDO Урок 2. GetCollection()'}
                          </Link>
                        </li>
                        {'\n'}
                        <li className="level4">
                          <Link
                            to="/documentation/modx/modx-revolution/xpdo-urok-3.-newquery.html"
                            title="xPDO Урок 3. newQuery()"
                          >
                            {'xPDO Урок 3. newQuery()'}
                          </Link>
                        </li>
                        {'\n'}
                        <li className="last level4">
                          <Link
                            to="/documentation/modx/modx-revolution/xpdo-urok-4.-select.html"
                            title="xPDO Урок 4. Select()"
                          >
                            {'xPDO Урок 4. Select()'}
                          </Link>
                        </li>
                        {'\n'}
                      </ul>
                    </li>
                    {'\n'}
                  </ul>
                </li>
                {'\n'}
              </ul>
            </li>
            {'\n'}
          </ul>
          {'\n\t'}
        </div>
      </div>
      <div className="center_block">
        {'\n        '}
        <div className="breadcrumbs">
          <span className="B_crumbBox">
            <span className="B_firstCrumb">
              <Link to="/">{'Главная'}</Link>
            </span>
            {' » '}
            <Link
              className="B_crumb"
              to="/documentation.html"
              title="Документация по ExtJS"
            >
              {'Документация'}
            </Link>
            {' » '}
            <Link
              className="B_crumb"
              to="/documentation/modx.html"
              title="CMS/CMF MODX"
            >
              {'CMS/CMF MODX'}
            </Link>
            {' » '}
            <Link
              className="B_crumb"
              to="/documentation/modx/modx-revolution.html"
              title="MODx Revolution"
            >
              {'MODx Revolution'}
            </Link>
            {' » '}
            <h1 className="B_lastCrumb" tabIndex={-1}>
              <span className="B_currentCrumb">
                {'MODx Revolution по шагам'}
              </span>
            </h1>
          </span>
        </div>
        {'\n        '}
        <div id="content">
          <p>
            {
              'В данном цикле статей попробуем разобрать MODx Revolution по шагам от самого простого к самому сложному.'
            }
          </p>
          {'\n'}
          <p>
            {
              'Для начала попробуем сразу обозначить какая информация для новичков, то есть для тех, кто с CMS на Вы в принципе, и для тех, кто уверенный веб-разработчик, и просто желает максимально быстро ознакомиться с данным движком, чтобы сходу взяться непосредственно за программирование на данном фреймворке.'
            }
          </p>
          {'\n'}
          <p>
            {
              'В принципе, даже начинающему веб-программисту достаточно знать HTML + CSS, освоить базовые принципы разработки на MODx Revolution, шаблоны, чанки, базовые сниппеты и всё! Уже можно создавать несложные сайты.'
            }
          </p>
          {'\n'}
          <p>
            {
              'Опытным программистам придется освоить гораздо больше, включая дополнительные TV-параметры, плагины, API и т.п.'
            }
          </p>
          {'\n'}
          <p>
            {
              'Итак, попробуем разобрать в целом парадигму программирования под MODx Revolution.'
            }
          </p>
          {'\n'}
          <p>{'1. Вся платформа держится на трех китах:'}</p>
          {'\n'}
          <ol>
            {'\n'}
            <li>
              <Link
                title="xPDO"
                to="/documentation/modx/modx-revolution/xpdo.html"
              >
                {'xPDO'}
              </Link>
              {
                '. Это ответвление от библиотеки PDO, которая используется для работы с различными типами баз данных. Используя PDO для построения запросов к БД, вам не придется переписывать код при миграции на другой тип БД. Вам достаточно будет в настройках только указать соответствующий тип базы данных, а PDO уже сам при обращении к БД сгенерирует соответствующий SQL-запрос под эту БД.'
              }
            </li>
            {'\n'}
            <li>
              <a
                title="MODx API documentation"
                href="http://api.modxcms.com/"
                target="_blank"
                rel="noopener noreferrer"
              >
                {'API MODx'}
              </a>
              {
                '. API - это интерфейс программирования. Практически во всех случаях, когда вы будете писать свой PHP-код под MODx Revolution, вы будете так или иначе использовать объект $modx и его свойства. К примеру, для того, чтобы получить нужный нам документ, зная его ID, мы не будем писать кучу PHP и SQL кода, а просто вызовим $doc = $modx->getDocument($id);'
              }
              <br />
              {
                'Так же стоит сразу отметить, что $modx расширяет объект $xpdo, то есть все методы xPDO можно вызывать и через объект $modx, в том числе методы работы с кэшем, БД и т.п.'
              }
            </li>
            {'\n'}
            <li>
              <Link
                title="javascript library ExtJS/Sencha"
                to="/documentation/extjs.html"
              >
                {'ExtJS/Sencha'}
              </Link>
              {
                '. Админ-панель полностью построена на этой мощной javascript-библиотеке. К сожалению, данная библиотека на сколько мощная, на столько же и сложная, по этому админка очень гибкая, но если вы захотите что-то в ней осознанно изменить, вам придется потратить не один день на освоение этой библиотеки.'
              }
            </li>
            {'\n'}
          </ol>
          {'\n'}
          <p>
            {
              'Что интересно, админ-панель не является неотъемлемой частью всей платформы. Вы легко можете удалить папку /manager (то есть всю админку), и, зная API MODx, написать свою, более легкую админ-панель. Или просто создать несколько параллельных админ-панелей. '
            }
          </p>
          {'\n'}
          <p>
            {
              'Вообще файловая модель MODx Revolution заслуживает особого внимания. Более детально об этом написано '
            }
            <Link
              title="Файловая модель MODx Revolution"
              to="/documentation/modx/modx-revolution/modx-revolution-fajlovaya-model.html"
            >
              {'тут'}
            </Link>
            {'.'}
          </p>
          {'\n'}
          <p>
            {
              '2. MODx Revolution - это конструктор. Для того, чтобы легко и быстро разрабатывать сайты на MODx Revolution, нужно четко понимать все программные элементы данной платформы. Практически все программные элементы MODx Revolution (кроме шаблонов и плагинов) прописываются в двойных квадратных скобках  (параметры не обязательный аргумент, потому не обязательно указывать), и могут быть использованы в любом месте шаблона, а так же внутри друг друга. Вообще все это очень напоминает язык Objectiv-C, так же вызывается объект и ему передаются дополнительные сообщения, в свою очередь в качестве сообщения может быть передан и другой объект, к примеру  ]]. Кратко опишем все эти элементы:'
            }
          </p>
          {'\n'}
          <ul>
            {'\n'}
            <li>
              <strong>{'Шаблон'}</strong>
              {' ('}
              <strong>{'Template'}</strong>
              {'). В MODx Revolution очень сильно развита модель '}
              <strong>{'MVC'}</strong>
              {
                ', то есть отделение визуализации от програмной части.  Для всех типичных страниц не надо каждый раз прописывать весь HTML-код в отдельности, достаточно создать один HTML-шаблон, в котором будет присутствовать плейсхолдер , который в момент генерации страницы будет заменен на контент конкретной страницы. Так же в шаблоне могут быть использованы и другие объекты MODx, такие как сниппеты, чанки, TV-параметры и т.п.'
              }
            </li>
            {'\n'}
            <li>
              <strong>{'Дополнительные параметры'}</strong>
              {' ('}
              <strong>{'TV'}</strong>
              {' или '}
              <strong>{'Template Variables'}</strong>
              {'). В шаблоне вызывается '}
              <strong></strong>
              {
                '. Очень полезная штука. К примеру, в каждом документе у нас есть базовые поля (Заголовок, расширенный заголовок, псевдоним, контент и т.п.). Но мы хотим так же добавить поле, в котором мы будем указывать путь к картинке превью. Вот мы создаем новый TV-параметр, указываем для каких шаблонов он доступен, и в дальнейшем, когда мы будем редактировать документ с таким шаблоном, у нас будет дополнительное поле, с помощью которого мы сможем выбрать картинку для этого документа. А в шаблоне мы просто вставим , и в этом месте будет выводиться значение этого дополнительного параметра.'
              }
            </li>
            {'\n'}
            <li>
              <strong>{'Сниппеты'}</strong>
              {' ('}
              <strong>{'Snippets'}</strong>
              {'). В шаблоне вызываются '}
              <strong></strong>
              {' (кэшируемый сниппет) или '}
              <strong></strong>
              {
                ' (некэшируемый сниппет). Данный элемент содержит исполняемый PHP-код (только). Переданные в сниппет параметры будут доступны внутри кода сниппета как PHP-параметры. К примеру вызываем  (наклонные ковычки '
              }
              <strong>{'`'}</strong>
              {
                ' используются для более явного опраделения начала и конца строкового значения параметра). Внутри сниппета эти параметры нам будут доступны как $param1 и $param2.  '
              }
              <br />
              {
                'Рассмотрим простой пример: если вы хотите в  шаблоне, к примеру, выводить текущее время, вы можете создать сниппет '
              }
              <strong>{'date'}</strong>
              {
                ", в нем прописать <?php return date('Y-m-d H:i:s');, а в шаблоне вызвать "
              }
              <strong></strong>
              {
                '. В результате при генерации страницы в месте вызова этого сниппета будут выведены дата и время.'
              }
              <br />
              {
                'Вот на этом простом примере мы сразу и рассмотрим разницу между выводом кэшируемого сниппета ('
              }
              <strong></strong>
              {') и некэшируемого ('}
              <strong></strong>
              {
                '). Если страница кэшируемая (указывается соответствующей галочкой в настройках каждой конкретной страницы), то в момент генерации конечной страницы создается ее кэш, и весь конечный HTML-код хранится в таком кэше, и в момент следующего вызова этой страницы не происходит повторной генерации страницы в полной мере, а просто отдается HTML-код из кэша. Так вот, если мы вызываем кэшируемый сниппет ('
              }
              <strong></strong>
              {
                '), то результат выполнения этого сниппета (в нашем случае дата и время), будет закэширован, то есть при обращении к этой же странице мы увидим не актуальную дату, а старую, не меняемую. Для того, чтобы сниппет каждый раз опять выполнялся, мы вызываем его с восклицательным знаком, который указывает, что данный сниппет некэшируемый ('
              }
              <strong></strong>
              {
                '). В результате у нас будет все закэшировано, кроме этого сниппета, который будет вызываться каждый раз при обращении к странице. Так, грамотно оперируя с моделью страницы, мы можем значительно снизить нагрузку на сервер, сократить время генерации страниц, и при этом не потерять в функциональности.'
              }
            </li>
            {'\n'}
            <li>
              <strong>{'Чанки'}</strong>
              {' ('}
              <strong>{'Chunks'}</strong>
              {').  В шаблоне вызывается '}
              <strong></strong>
              {
                '. Данный элемент используется для HTML-кода. Переданные в чанк параметры будут видны в коде чанка как плейсхолдеры, то есть .'
              }
              <br />
              {
                'К примеру у вас во всех шаблонах будет выводиться одно и то же меню. Не нужно в каждом шаблоне прописывать это меню. Достаточно создать свой пользовательский '
              }
              <strong>{'чанк'}</strong>
              {', к примеру '}
              <strong>{'mainMenu'}</strong>
              {
                ', прописать в этом чанке код меню, а к нужны шаблонах в месте вывода меню просто прописать чанк . Так же в чанк вы можете прописать не только статический HTML, но и другие объекты MODx. К примеру, для динамического формирования меню вы используете сниппет Wayfinder. Тогда в чанке вы прописываете вызов сниппета с параметрами (если они нужны) &level=2&outerClass=`main`]], а чанк уже вставить в шаблон в виде . В процессе генерации страницы MODx обработает переменную  и заменит ее на системную настройку корня сайта, передаст это значение в сниппет Wayfinder, который сгенерирует код меню и вернет этот код в чанк, а конечный код чанка в свою очередь будет выведен в шаблон в место расположения этого чанка.'
              }
              <br />
              {
                'Все это может показаться довольно сложным, но поверьте - это на самом деле очень удобно, так как вы четко отделяете логику от статики. Вы четко отделяете динамические и статические элементы, и используете их как конструктор, оперируя ими как отдельными сущностями. В результате, когда вам нужно будет что-то поменять, вы не будете ковырять весь движек, а будете редактировать четко отдельный элемент. А за нагрузку не беспокойтесь. В MODx шикарная система кэширования, и раз сгенерировав страницу, в следующий раз при обращении к этой странице большая часть логики уже лежит как статический HTML.'
              }
            </li>
            {'\n'}
            <li>
              <strong>{'Плейсхолдеры'}</strong>
              {' ('}
              <strong>{'Placeholders'}</strong>
              {'). В шаблоне вызываются '}
              <strong></strong>
              {
                '. Плейсхолдеры - это статические переменные шаблонизатора. То есть если мы в шаблоне пропишем , то объявив плейсхолдер '
              }
              <strong>{'date'}</strong>
              {
                ' и передав в него какое-либо значение, в момент обработки кода шаблонизатором, плейсхолдер  будет заменен на его значение.'
              }
              <br />
              {'Плейсхолдер может быть объявлен двумяспособами:\n'}
              <ul>
                {'\n'}
                <li>
                  {
                    'Как мы уже говорили выше, он может быть передан в виде параметра в чанк.'
                  }
                </li>
                {'\n'}
                <li>
                  {
                    'Через API MODx в сниппете или плагине: $modx->setPlaceholder($placeholderNname, $value).'
                  }
                </li>
                {'\n'}
              </ul>
              {'\n'}
            </li>
            {'\n'}
            <li>
              <strong>{'Системные настройки'}</strong>
              {'. В шаблоне вызываются '}
              <strong></strong>
              {
                '. В качестве системных настроек мы можем перехватить, к примеру, название сайта ('
              }
              <strong></strong>
              {'), полный адрес сайта ('}
              <strong></strong>
              {'), адрес корня сайта ('}
              <strong></strong>
              {
                ') и т.п., а можем и свои указывать. Все настройки можно увидеть во вкладке Система->Настройки системы.'
              }
              <br />
              {
                'Системные настройки - отдельная история и будут рассмотрены в отдельной статье.'
              }
            </li>
            {'\n'}
            <li>
              <strong>{'Плагины'}</strong>
              {' ('}
              <strong>{'Plugins'}</strong>
              {
                '). В шаблоне не вызываются никак. Плагины вызываются, срабатывая на определенные события (мы сами указываем на какие, к примеру '
              }
              <strong>{'OnWebPageInit'}</strong>
              {', то есть  в момент инициализации страницы, или '}
              <strong>{'OnPageNotFound'}</strong>
              {', то есть в момент, когда страница не найдена). '}
              <br />
              {
                'Конечно плагин можно вызвать и через API MODx, но это не правильно.'
              }
              <br />
              {
                'Плагины - очень мощный инструмент, позволяющий легко расширить платформу, практически не трогая кода самой платформы. К примеру, я хочу добавить свой модуль к системе. Создаем плагин, называем его как хотим, назначаем ему выполнение в момент иинициализации страницы. В плагине прописываем, наш PHP код. В момент инициализации страницы код нашего плагина срабатывает внутри системы с полным доступом к объекту $modx. В результате мы можем и работать с настройками платформы, и воздействовать на всю логику в целом и т.п.'
              }
            </li>
            {'\n'}
          </ul>
          {'\n'}
          <p>
            {
              'Итак,  самое главное - это освоить эти элементы каждый в отдельности, и научиться использовать их совместно. В результате вы не заморачиваетесь с разработкой самой модели сайта, а программируете непосредственно сам сайт.'
            }
          </p>
          {'\n'}
          <p>
            {
              'В дальнейших уроках мы рассмотрим каждый из представленных элементов в отдельности.'
            }
          </p>
          {'\n'}
          <ul>{'\n'}</ul>
          {'\n        '}
          <div className="clear"></div>
          {'\n        '}
          <p>{'  '}</p>
          {'\n        '}
          <div className="meOnHabr">
            {'Если вам помог мой материал и вы есть на Хабрахабре, '}
            <a
              href="http://fi1osof.habrahabr.ru/"
              title="я на Хабре"
              target="_blank"
              rel="noopener noreferrer"
            >
              {'плюсание карму в дар'}
            </a>
            {' :-)'}
          </div>
          <div id="rang" className="center">
            {' '}
          </div>
          <div id="navigator"></div>
          {'\n    '}
        </div>
        {'\n'}
      </div>
      <div className="clear"></div>
    </div>
  )
}
export const ModxStepsPage: React.FC = () => (
  <DocumentationLayout scripts={scripts}>
    <Content />
  </DocumentationLayout>
)
