import type * as React from 'react'
import { Link } from 'react-router'
import { CmsOverviewPageStyled } from './styles'

export const CmsOverviewPage: React.FC = () => {
  return (
    <CmsOverviewPageStyled>
      <div className="middle">
        <div className="left_block">
          <div className="menu">
            <ul className="menu">
              <li className="level1">
                <Link to="/" title="Главная страница">
                  Главная
                </Link>
              </li>

              <li className="level1">
                <Link to="/about.html" title="О компании">
                  О компании
                </Link>
              </li>

              <li className="level1 active">
                <Link to="/services.html" title="Услуги">
                  Услуги
                </Link>
                <ul>
                  <li className="level2">
                    <Link
                      to="/services/sozdanie-saitov.html"
                      title="Создание сайтов"
                    >
                      Создание сайтов
                    </Link>
                  </li>

                  <li className="level2">
                    <Link
                      to="/services/poiskovoe-prodvigenie.html"
                      title="Поисковое продвижение сайтов"
                    >
                      Поисковое продвижение
                    </Link>
                  </li>

                  <li className="last level2 active">
                    <Link
                      to="/services/poddergka-prodvigenie.html"
                      title="Поддержка, продвижение сайтов"
                    >
                      Поддержка, продвижение
                    </Link>
                    <ul>
                      <li className="level3">
                        <Link
                          to={
                            '/services/poddergka-prodvigenie/polnaya-poddergka-saytov.html'
                          }
                          title="Полная поддержка сайтов"
                        >
                          Полная поддержка сайтов
                        </Link>
                      </li>

                      <li className="level3">
                        <Link
                          to={
                            '/services/poddergka-prodvigenie/kak-obnovlyat-sait-samomu.html'
                          }
                          title="Как обновлять сайт самому?"
                        >
                          Как обновлять сайт самому?
                        </Link>
                      </li>

                      <li className="last level3 active self">
                        <Link
                          to={
                            '/services/poddergka-prodvigenie/obzor-populyarnyh-cms.html'
                          }
                          title={
                            'Краткий обзор популярных Систем Управления Контентом'
                          }
                        >
                          Обзор популярных CMS
                        </Link>
                      </li>
                    </ul>
                  </li>
                </ul>
              </li>

              <li className="level1">
                <Link to="/portfolio.html" title="Портфолио">
                  Портфолио
                </Link>
              </li>

              <li className="level1">
                <Link to="/documentation.html" title="Документация">
                  Документация
                </Link>
              </li>

              <li className="last level1">
                <Link to="/contacts.html" title="Контактная  информация">
                  Контактная информация
                </Link>
              </li>
            </ul>{' '}
          </div>
        </div>

        <div className="center_block">
          <div className="breadcrumbs">
            <span className="B_crumbBox">
              <span className="B_firstCrumb">
                <Link to="/">Главная</Link>
              </span>{' '}
              »{' '}
              <Link
                className="B_crumb"
                to="/services.html"
                title={
                  'Услуги веб-студии "Новая парадигма". Создание, поддержка и продвижение сайтов'
                }
              >
                Услуги
              </Link>{' '}
              »{' '}
              <Link
                className="B_crumb"
                to="/services/poddergka-prodvigenie.html"
                title="Поддержка, продвижение сайтов"
              >
                Поддержка, продвижение
              </Link>{' '}
              »{' '}
              <h1 className="B_lastCrumb" tabIndex={-1}>
                <span className="B_currentCrumb">Обзор популярных CMS</span>
              </h1>
            </span>
          </div>

          <div id="content">
            <p>
              <br />
              Давайте зададимся вопросом о том, какая технология позволила в
              последние годы вырасти огромному количеству сложнейших
              динамических сайтов, владельцами и администраторами которых
              зачастую являются совсем не искушенные в высоких
              Интернет-технологиях люди или люди, не обладающие достаточными
              средствами для найма квалифицированных специалистов для разработки
              подобных проектов. Ведь корпоративный сайт может состоять из тысяч
              динамически обновляемых страниц, менеджментом которых вручную
              заниматься просто невозможно. Естественно, нужна централизованная
              система управления и обновления содержания (контента) сайта. Ранее
              такие системы разрабатывались индивидуально под каждый проект, в
              связи с чем стоимость комплексного проекта возрастала многократно.
              Однако теперь любому веб-мастеру доступна такая технология, как
              CMS или Content Management System — система управления контентом.
            </p>

            <p>{' '}</p>

            <p>
              Технология CMS позволила не только упростить поддержку сложных
              интернет-проектов, сохраняя и улучшая при этом качество, но и
              создала целый сегмент «сайтов для домохозяек» — подчас довольно
              сложных динамических ресурсов, управлять и владеть которыми может
              даже совсем неискушенный&nbsp; в вопросах веб-администрирования
              пользователь. На сегодняшний день более 95% процентов компаний
              используют CMS при разработке своих проектов. Поверьте, установить
              и настроить Систему Управления Контентом не так уж и сложно, и мы
              поможем Вам в этом.
            </p>

            <p>{' '}</p>

            <p>
              Но для того, чтобы не быть голословными, давайте рассмотрим, какие
              же CMS в данный момент представлены на рынке и какие плюсы и
              минусы мы видим в тех или иных видах систем.
            </p>

            <p>{' '}</p>

            <p>
              Начнем с продукта нашей отечественной компании 1С, хорошо
              известной всем, кто имеет отношение к коммерции, по таким
              продуктам как «1С: Бухгалтерия», «1С: Предприятие» и прочим из той
              же линейки. ПО для управления содержимым сайта от этого
              производителя носит название 1С: Битрикс. Согласно опросам,
              проводившимся экспертной группой проекта TAGLINE, эта CMS является
              бесспорным лидером готовых решений управления содержанием на
              настоящий момент, занимая долю рынка объемом более 65% (
              <a
                href="http://2009.tagline.ru/results/cms.html"
                rel="noopener noreferrer"
                target="_blank"
              >
                http://2009.tagline.ru/results/cms.html
              </a>
              ). Является вполне профессиональной и функциональной системой,
              имеющей (что немаловажно) документацию на русском языке. Еще одним
              плюсом для крупного проекта является возможность нанять
              недорогостоящую команду специалистов по Битрикс. Однако, «движок»
              системы устарел и производительность, увы, оставляет желать
              лучшего. Кроме того, нельзя оставить без внимания тот факт, что
              многие бесплатные конкуренты 1С: Битрикс могут порадовать
              пользователя более широким функционалом, взять хотя бы широко
              известную Joomla! или ничуть не менее известную систему MODx —
              мало того, что бесплатную, так еще и довольно простую в изучении,
              легко настраиваемую и способную поддержать&nbsp; любые проекты от
              сайта-визитки до серьезного бизнес-проекта. MODx получает все
              больше признания среди веб-администраторов и контент-менеджеров в
              настоящее время.
            </p>

            <p>{' '}</p>

            <p>
              MODx — это профессиональный пакет инструментов для разработки и
              администрирования сайта, а также для управления его содержанием, с
              очень богатым функционалом и возможностями настройки. Система MODx
              поставляется на условиях open source, то есть с открытым кодом, и
              является совершенно бесплатной. В отличие от большинства своих
              бесплатных конкурентов MODx способна поддерживать проект любого
              уровня сложности, позволяет осуществлять многоуровневую настройку
              и реализовывать функциональные элементы любой сложности, не влияя
              при этом на html-код. Мы широко применяем MODx, так как стремимся
              предоставлять неизменно высокий технологический уровень
              оказываемых нами услуг.
            </p>

            <p>{' '}</p>

            <p>
              Из других наиболее популярных CMS хотелось бы остановиться также
              на WordPress и Drupal. Первая CMS – простая, довольно быстрая
              система начального уровня, предназначенная в основном для ведения
              блогов. Зарекомендовавшая себя на протяжении нескольких лет
              успешного применения, WordPress успешно применяется даже на
              некоторых крупных зарубежных блогах с числом уникальных
              посетителей более двух тысяч в сутки, тем не менее являясь слишком
              примитивной для решения комплексных задач наших клиентов.
            </p>

            <p>{' '}</p>

            <p>
              Drupal — еще один бесплатный продукт, пользующийся определенным
              спросом на рынке. Drupal имеет особую архитектуру и безусловно ряд
              своих положительных моментов, также присутствует возможность
              использования его для различных сайтов. Однако, что касается
              удобства пользования, то Drupal проигрывает системе MODx — пусть и
              не нокаутом в первом раунде, как Битрикс, но как минимум по очкам.
            </p>

            <p>{' '}</p>

            <p>
              Не на последнем месте по опросам вышеупомянутой группы TAGLINE
              стоит также такая система, как UMI.CMS, на наш взгляд вполне
              работоспособная. Огорчает однако тот факт, что коммерческая версия
              имеет слегка завышенную цену, а версия для бесплатного
              распространения не выдерживает никакой критики — ни по набору
              функций, ни по удобству пользовательского интерфейса.
            </p>

            <p>{' '}</p>

            <p>
              Опираясь на наш богатый опыт разработки веб-проектов, мы с
              уверенностью можем рекомендовать нашим уважаемым клиентам MODx —
              систему-лидера среди профессионалов, что, однако, не делает её
              менее дружественной к пользователю. Поручив нам установку именно
              этой CMS, Вы получите набор удобных инструментов, обращаться с
              которыми сможете не только Вы, но даже Ваш ребенок — настолько
              просто и интуитивно организован интерфейс этой CMS.
            </p>

            <p>{' '}</p>

            <p>
              Приведенный в настоящем обзоре список CMS далеко не полон, и даже
              ключевых продуктов этой категории на рынке насчитывается более
              десяти. Тем не менее, безусловный вклад в развитие Интернета
              технологии CMS неоспорим, и, по нашему мнению, Система Управления
              Контентом — это технологический стандарт для любого серьезного и
              крупного веб-проекта в наши дни.
              <br />
              <br />
            </p>
          </div>
        </div>

        <div className="clear"></div>
      </div>
    </CmsOverviewPageStyled>
  )
}
