import type * as React from 'react'
import { Link } from 'react-router'
import { SupportPageStyled } from './styles'

export const SupportPage: React.FC = () => {
  return (
    <SupportPageStyled>
      <div className="middle">
        <div className="left_block">
          <div className="menu">
            <ul className="menu">
              <li className="level1">
                <Link to="/" title="Главная страница">
                  Главная
                </Link>
              </li>

              <li className="level1">
                <Link to="/about.html" title="О компании">
                  О компании
                </Link>
              </li>

              <li className="level1 active">
                <Link to="/services.html" title="Услуги">
                  Услуги
                </Link>
                <ul>
                  <li className="level2">
                    <Link
                      to="/services/sozdanie-saitov.html"
                      title="Создание сайтов"
                    >
                      Создание сайтов
                    </Link>
                  </li>

                  <li className="level2">
                    <Link
                      to="/services/poiskovoe-prodvigenie.html"
                      title="Поисковое продвижение сайтов"
                    >
                      Поисковое продвижение
                    </Link>
                  </li>

                  <li className="last level2 active self">
                    <Link
                      to="/services/poddergka-prodvigenie.html"
                      title="Поддержка, продвижение сайтов"
                    >
                      Поддержка, продвижение
                    </Link>
                    <ul>
                      <li className="level3">
                        <Link
                          to={
                            '/services/poddergka-prodvigenie/polnaya-poddergka-saytov.html'
                          }
                          title="Полная поддержка сайтов"
                        >
                          Полная поддержка сайтов
                        </Link>
                      </li>

                      <li className="level3">
                        <Link
                          to={
                            '/services/poddergka-prodvigenie/kak-obnovlyat-sait-samomu.html'
                          }
                          title="Как обновлять сайт самому?"
                        >
                          Как обновлять сайт самому?
                        </Link>
                      </li>

                      <li className="last level3">
                        <Link
                          to={
                            '/services/poddergka-prodvigenie/obzor-populyarnyh-cms.html'
                          }
                          title={
                            'Краткий обзор популярных Систем Управления Контентом'
                          }
                        >
                          Обзор популярных CMS
                        </Link>
                      </li>
                    </ul>
                  </li>
                </ul>
              </li>

              <li className="level1">
                <Link to="/portfolio.html" title="Портфолио">
                  Портфолио
                </Link>
              </li>

              <li className="level1">
                <Link to="/documentation.html" title="Документация">
                  Документация
                </Link>
              </li>

              <li className="last level1">
                <Link to="/contacts.html" title="Контактная  информация">
                  Контактная информация
                </Link>
              </li>
            </ul>{' '}
          </div>
        </div>

        <div className="center_block">
          <div className="breadcrumbs">
            <span className="B_crumbBox">
              <span className="B_firstCrumb">
                <Link to="/">Главная</Link>
              </span>{' '}
              »{' '}
              <Link
                className="B_crumb"
                to="/services.html"
                title={
                  'Услуги веб-студии "Новая парадигма". Создание, поддержка и продвижение сайтов'
                }
              >
                Услуги
              </Link>{' '}
              »{' '}
              <h1 className="B_lastCrumb" tabIndex={-1}>
                <span className="B_currentCrumb">Поддержка, продвижение</span>
              </h1>
            </span>
          </div>

          <div id="content">
            <blockquote>
              <p className="justifyright">
                Самое большое и опасное искушение – желать слишком малого
                успеха.{' '}
              </p>

              <p className="justifyright">
                <strong>©Томас Мертон</strong>
              </p>
            </blockquote>

            <p>{' '}</p>

            <p>{' '}</p>

            <p>
              Создание сайта, даже самого полного и качественно выполненного —
              это лишь половина дела. Да, если ваш ресурс только появился в
              сети, поначалу на него может прийти много посетителей. Особенно
              если вы расскажете своим клиентам о том, что у вашей компании
              теперь есть своя страница во всемирной паутине. Но со временем
              число заходящих на сайт-визитку или крупный портал людей пойдет на
              спад, а постепенно и вовсе приблизится к нулевой отметке. Вы
              начинаете думать, что проблема в контенте или же в дизайне. Но это
              не так. Даже самый лучший сайт с уникальным оформлением и
              наполнением нуждается в уходе, совсем как трепетное экзотическое
              растение. Доверять его нужно лишь профессионалам, иначе ресурс
              обречен на гибель. В данном случае уход именуется поддержкой и
              продвижением, необходимыми составляющими развития проекта после
              разработки сайта.
            </p>

            <p>{' '}</p>

            <p>
              Начнем мы с продвижения сайта. Что же это такое? Продвижением
              сайта, иначе "раскруткой сайта", называют ряд мер, которые
              направлены на обеспечение максимального количества посетителей на
              сайте. Причем учитываются лишь целевые посетители, то есть такие,
              которые хотят приобрести ваши товары или услуги.{' '}
            </p>

            <p>{' '}</p>

            <p>
              Продвижение сайта состоит из нескольких этапов. Необходимо помнить
              о том, что раскрутить ресурс невозможно в один момент, это
              длительная работа, требующая временных и материальных затрат.
              Начинают как правило с самого важного — с поисковой оптимизации
              сайта. Оптимизация сайта под поисковые системы повышает позицию
              ресурса в таких известных поисковых системах как Яндекс, Гугл или
              Рамблер. Как результат — целевая посещаемость растет за счет того,
              что ваш сайт чаще фигурирует в выдачах на поисковые запросы
              пользователей. Тут нужно иметь в виду то обстоятельство, что если
              поисковые системы&nbsp; не смогут нормально индексировать полезный
              контент на сайте, то и в результатах поисковых запросов ничего не
              появится, как не старайся. Именно поэтому без поискового
              продвижения сайта невозможна дальнейшая работа по раскрутке
              проекта.{' '}
            </p>

            <p>{' '}</p>

            <p>
              Теперь разберемся в том, что влияет на место ресурса в поисковой
              системе. Тут играет роль большое число факторов, которые
              подразделяют на внешние и внутренние.{' '}
            </p>

            <p>{' '}</p>

            <p>
              <strong>Внутренние факторы</strong>
            </p>

            <p>
              <em>{' '}</em>
            </p>

            <p>
              Сам ресурс определяет внутренние факторы. В их число входит все,
              начиная от контента и заканчивая названием домена. Проще говоря,
              внутренние факторы диктуют степень оптимизации сайта под
              конкретный поисковой запрос. Важную роль играет все, в том числе и
              то, каков заголовок страницы, содержит ли он ключевые слова или же
              нет. Внутренние ссылки (между страницами сайта) также обязательно
              должны присутствовать.{' '}
            </p>

            <p>{' '}</p>

            <p>
              <strong>Внешние факторы</strong>
            </p>

            <p>
              <em>{' '}</em>
            </p>

            <p>
              В отличие от внутренних, внешние факторы определяют другие
              ресурсы. Отметим следующие факторы:
            </p>

            <ul>
              <li>
                Ссылочное ранжирование, иными словами — число ссылок на
                веб-сайт.
              </li>

              <li>
                PR в поисковой системе Google вкупе с индексом цитирования в
                поисковой системе Яндекс
              </li>
            </ul>

            <p>{' '}</p>

            <p>
              Кроме вышеописанных внешних факторов существуют и другие. Все они
              играют очень важную роль, благодаря профессиональной работе можно
              довольно быстро обойти конкурирующие проекты.{' '}
            </p>

            <p>{' '}</p>

            <p>
              Наконец, нужно учитывать еще и тот факт, что влияние любого из
              факторов, как внешнего, так и внутреннего, весьма относительно.
              Если сегодня сайт занял высокие позиции путем применения
              какого-либо метода, то завтра тот же самый метод может уже не
              работать. Как вывод — над проектом следует работать постоянно,
              поддерживая его место в поисковой системе.{' '}
            </p>

            <p>{' '}</p>

            <p>
              Один из этапов поискового продвижения сайта — это прогон по
              наиболее крупным каталогам. Правильно проведенная работа по
              регистрации сайта в каталогах будет гарантировать появление
              некоторого количества ссылок на него. Это необходимо для
              наращивания ссылочной массы. Как результат — увеличивается ТИЦ
              (рейтинг цитируемости).
            </p>

            <p>{' '}</p>

            <p>
              После этого следует поиск ресурсов, тематика которых схожа с
              вашим, для того, чтобы обменяться с ними ссылками. Сегодня этот
              метод — самый эффективный и доступный для продвижения сайта под
              поисковые запросы.{' '}
            </p>

            <p>{' '}</p>

            <p>
              Некоторые предпочитают ручному обмену ссылок их покупку. Но если
              переборщить с количеством ссылок, то ресурс вполне могут забанить
              в поисковых системах. Правда данная методика имеет и ряд
              достоинств, самым важным из которых является ее чистота. Этот
              способ — полностью «белый».{' '}
            </p>

            <p>{' '}</p>

            <p>
              Помимо поискового продвижения сайта есть и другие способы.
              Рассмотрим их подробнее.
            </p>

            <p>{' '}</p>

            <p>
              <strong>Контекстная реклама</strong>
            </p>

            <p>
              <em>{' '}</em>
            </p>

            <p>
              Особенность такого метода состоит в том, что данный тип рекламы
              возникает лишь тогда, когда посетитель заинтересовался чем-либо.
              Она автоматически подбирается исходя из содержимого страницы и
              местонахождения сайта или блога в конкретном тематическом
              каталоге. А это значит, что о вас узнают именно те люди, которым
              нужна ваша продукция.&nbsp; Услуги и товары должны предлагаться
              тем, кому они действительно необходимы. Это и есть достоинство
              контекстной рекламы.{' '}
            </p>

            <p>{' '}</p>

            <p>
              <strong>Продвижение сайта статьями</strong>
            </p>

            <p>
              <em>{' '}</em>
            </p>

            <p>
              Еще один из вариантов повысить количество посещаемости сайта — это
              использование оптимизированных под конкретные запросы статей. Тут
              все просто — поисковые системы индексируют сайт, и тогда, когда
              кто-либо начинает искать соответствия по нужной фразе, ему
              выдаются сайты в порядке популярности. Качественный контент — не
              иначе, как главная составляющая любого ресурса, начиная от
              сайта-визитки и заканчивая интернет-магазином. Именно верно
              подобранные ключевые слова помогают войти в топ самых популярных
              страниц и в результате привлечь внимание потенциальных покупателей
              товаров и услуг.{' '}
            </p>

            <p>{' '}</p>

            <p>
              Лишь комплексное применение всех способов продвижения веб-сайта
              может дать относительно быстрые и хорошие результаты.
              Профессионалы нашей компании определят методы, оптимально
              подходящие для вашего ресурса.{' '}
            </p>

            <p>{' '}</p>

            <p>
              Раскрутка сайта — лишь одна из составляющих успеха. Нельзя
              забывать и о поддержке web сайта. А начинать ее следует с анализа
              имеющегося ресурса. Есть ряд показателей, по которым можно без
              труда определить жив проект или уже мертв. Перечислим самые
              существенные из этих показателей.
            </p>

            <ul>
              <li>
                Ведутся работы по наполнению ресурса данными, в том числе
                акциями, статьями, обзорами и многим другим.
              </li>

              <li>
                Сайт работает без перебоев, а это значит, что все ошибки
                исправляются профессионалами, а хостинг надежен и стабилен.
              </li>

              <li>
                Информация всегда актуальна, она должна меняться, если, к
                примеру, изменился контактный телефон.
              </li>

              <li>
                Периодически меняется оформление, ведутся работы по улучшению
                работоспособности ресурса и его удобства для посетителей.
              </li>

              <li>
                Наконец, можно наблюдать возникновение новых сервисов, опросов,
                голосований. На все комментарии в гостевой книге в срок отвечают
                и так далее.{' '}
              </li>
            </ul>

            <p>{' '}</p>

            <p>
              Итак, подытожив все вышесказанное, сделаем вывод. Техническая
              поддержка сайтов вкупе с информационной является комплексом мер,
              направленных на оживление веб-ресурсов. Благодаря грамотному
              обслуживанию сайта можно создать положительное впечатление о
              компании и удовлетворить потребность в информации о фирме ее
              потенциальных клиентов.
            </p>

            <p>{' '}</p>

            <p>
              Если сайт развивается наравне с организацией, отвечает всем
              последним тенденциям, то у посетителя подобного ресурса непременно
              возникнет желание приобрести что-либо. И в этом нет ничего
              удивительного, ведь отношение фирмы к своему сайту аналогично
              отношению ее к заказчикам товаров и услуг.{' '}
            </p>

            <p>{' '}</p>

            <p>
              Хотите, чтобы ваша визитная карточка — сайт компании — была
              великолепна, выверена и всегда отвечала&nbsp; действительности?
              Тогда доверяйте поддержку ресурса лишь профессионалам! Яркий,
              интересный и открытый для контактов с клиентами ресурс станет для
              вас первым шагом к сотрудничеству с большим количеством новых
              заказчиков.{' '}
            </p>

            <p>{' '}</p>

            <p>
              Наконец, мы дошли до анализа сайта. Выше уже упоминалось о данной
              мере как первой стадии работ по продвижению сайта. Действительно,
              прежде чем заниматься созданием веб сайта, нужно задуматься над
              вопросом каким будет ресурс, какие цели преследует создание сайта
              под ключ.
            </p>

            <p>{' '}</p>

            <p>
              Нельзя не согласиться с тем, что сайты компаний создаются не
              просто так, не для галочки, не для того, «чтобы был». Цель ресурса
              фирмы — повысить эффективность работы, увеличить количество продаж
              и число клиентов. Часто в нашу компанию обращаются с целью
              проанализировать уже существующий ресурс, который не приносит
              должной прибыли. Да, скажем прямо, что если изготовлением сайта
              занимались непрофессионалы, результатов никаких ждать не стоит.
              Подобная страница будет лишь бесполезным придатком, вытягивающим
              деньги на хостинг каждый месяц. Хотите, чтобы сайт приносил
              реальную пользу? Тогда обращайтесь к нам за анализом сайта.
            </p>

            <p>{' '}</p>

            <p>Немного расскажем о том, что же он из себя представляет.</p>

            <p>{' '}</p>

            <p>
              Услуги по анализу сайтов и проектированию бывают разного рода.
              Выделяют несколько типов seo анализа сайтов, а в соответствие им
              ставят различные аналитические отчеты. Итак, бывает:
            </p>

            <ul>
              <li>Маркетинговое исследование имеющегося ресурса</li>

              <li>Проектирование структуры ресурса и его возможностей</li>

              <li>Исследование конкурентов</li>

              <li>Анализ позиции сайта с точки зрения поисковых систем</li>

              <li>
                Составление технических заданий на разработку либо улучшение
                структуры портала
              </li>

              <li>И тендерное исследование.</li>
            </ul>

            <p>{' '}</p>

            <p>
              Мы поможем вам разобраться с причиной непопулярности вашего
              веб-ресурса. Опытные специалисты отлично разбираются во всех типах
              аудита сайтов.{' '}
            </p>

            <p>{' '}</p>

            <p>
              В идеале, заказывая создание сайта, любая компания хочет видеть
              результаты его работы. То есть приток клиентов и увеличение объема
              продаж. Тут арифметика проста — доходы фирмы будут расти
              пропорционально силам, потраченным на поддержку и сопровождение
              сайтов, а также продвижение сайтов. Доверяйте работу над проектом
              профессионалам нашей компании, и вам больше никогда не придется
              удивляться чересчур низкой прибыли!
            </p>

            <p>{' '}</p>

            <p>
              Наша компания уделяет большое внимание поддержке сайтов наших
              клиентов. Хотя на сегодня&nbsp; существует очень много различных
              Систем Управления Контентом (CMS), которые позволяют сравнительно
              легко управлять контентом сайтов, все же особо это не облегчает
              жизнь простым&nbsp; пользователям. Дело в том, что помимо наличия
              самой возможности размещения информации на сайте, нужно все же
              разбираться в принципах формарования веб-страниц как минимум.
              Иначе размещенная информация может выглядеть совсем не так, как
              того хотелось бы. Итог - потеря большого количества времени и
              нервов. Плюс, если это обязанности Вашего сотрудника, то еще это и
              потеря денег за его рабочее время.
            </p>

            <p>{' '}</p>

            <p>
              Мы заключаем договора на абонентское обслуживание и поддержку
              Ваших сайтов.
            </p>

            <p>{' '}</p>

            <p>
              <strong>В чем выгода такого обслуживания&nbsp; для Вас:</strong>
            </p>

            <ul>
              <li>
                <strong>Экономия Вашего времени.</strong> Вы просто передаете
                нам материалы, которые должны быть размещены на вашем сайте, и
                всё! Вся информация будет размещена в кратчайшие сроки, чаще
                всего в течении одного-трёх часов.
              </li>

              <li>
                <strong>Экономия Ваших денег на поддержании сайта.</strong>{' '}
                Посчитайте сами, сколько Вы платите в месяц своему сотруднику за
                работу с сайтом. Наши сотрудники выполнят тот же объем работ,
                только гораздо быстрее и <strong>от 300 рублей за час!</strong>
              </li>

              <li>
                <strong>Экономия Ваших денег на создании сайта.</strong> При
                заключении договора на абонентское обслуживание, мы разработаем{' '}
                <strong>сайт для Вас бесплатно!</strong>
              </li>

              <li>
                <strong>Экономия Ваших денег на обновлении сайта. </strong>
                Если&nbsp; Ваш сайт устарел, или не отвечает Вашим требованиям и
                требует значительного обновления дизайна и функционала, мы
                сделаем это для Вас <strong>
                  со значительными скидками
                </strong>{' '}
                при заключении договора на абонентское обслуживание.
              </li>
            </ul>

            <p>{' '}</p>

            <p className="green">
              <strong>
                Звоните нам, и мы обязательно найдем оптимальное решение для
                Вашего сайта!
              </strong>
            </p>

            <ul></ul>
          </div>
        </div>

        <div className="clear"></div>
      </div>
    </SupportPageStyled>
  )
}
