import type * as React from 'react'
import { Link } from 'react-router'
import { SearchPromotionPageStyled } from './styles'

export const SearchPromotionPage: React.FC = () => {
  return (
    <SearchPromotionPageStyled>
      <div className="middle">
        <div className="left_block">
          <div className="menu">
            <ul className="menu">
              <li className="level1">
                <Link to="/" title="Главная страница">
                  Главная
                </Link>
              </li>

              <li className="level1">
                <Link to="/about.html" title="О компании">
                  О компании
                </Link>
              </li>

              <li className="level1 active">
                <Link to="/services.html" title="Услуги">
                  Услуги
                </Link>
                <ul>
                  <li className="level2">
                    <Link
                      to="/services/sozdanie-saitov.html"
                      title="Создание сайтов"
                    >
                      Создание сайтов
                    </Link>
                  </li>

                  <li className="level2 active self">
                    <Link
                      to="/services/poiskovoe-prodvigenie.html"
                      title="Поисковое продвижение сайтов"
                    >
                      Поисковое продвижение
                    </Link>
                    <ul>
                      <li className="level3">
                        <Link
                          to={
                            '/services/poiskovoe-prodvigenie/301_redirect.html'
                          }
                          title="Как правильно перенести сайт"
                        >
                          Как правильно перенести сайт
                        </Link>
                      </li>

                      <li className="level3">
                        <Link
                          to={
                            '/services/poiskovoe-prodvigenie/geograficheskaya-prinadlegnost.html'
                          }
                          title="Географическая принадлежность"
                        >
                          Географическая принадлежность
                        </Link>
                      </li>

                      <li className="last level3">
                        <Link
                          to={
                            '/services/poiskovoe-prodvigenie/slogno-li-byt-pervym-v-rossii.html'
                          }
                          title="Сложно ли быть первым в России?"
                        >
                          Сложно ли быть первым в России?
                        </Link>
                      </li>
                    </ul>
                  </li>

                  <li className="last level2">
                    <Link
                      to="/services/poddergka-prodvigenie.html"
                      title="Поддержка, продвижение сайтов"
                    >
                      Поддержка, продвижение
                    </Link>
                  </li>
                </ul>
              </li>

              <li className="level1">
                <Link to="/portfolio.html" title="Портфолио">
                  Портфолио
                </Link>
              </li>

              <li className="level1">
                <Link to="/documentation.html" title="Документация">
                  Документация
                </Link>
              </li>

              <li className="last level1">
                <Link to="/contacts.html" title="Контактная  информация">
                  Контактная информация
                </Link>
              </li>
            </ul>{' '}
          </div>
        </div>

        <div className="center_block">
          <div className="breadcrumbs">
            <span className="B_crumbBox">
              <span className="B_firstCrumb">
                <Link to="/">Главная</Link>
              </span>{' '}
              »{' '}
              <Link
                className="B_crumb"
                to="/services.html"
                title={
                  'Услуги веб-студии "Новая парадигма". Создание, поддержка и продвижение сайтов'
                }
              >
                Услуги
              </Link>{' '}
              »{' '}
              <h1 className="B_lastCrumb" tabIndex={-1}>
                <span className="B_currentCrumb">Поисковое продвижение</span>
              </h1>
            </span>
          </div>

          <div id="content">
            <p>
              Просто сделать сайт - этого не достаточно. Это все равно как
              поставить торговую палатку где-нибудь посредине пустыни и ждать,
              когда хлынут толпы клиентов, от которых просто не будет отбоя.
              Звучит мало реально, не правда ли?
            </p>

            <p>{' '}</p>

            <p>
              На самом деле так же мало реально чтобы сайт без каких-либо усилий
              сразу стал часто посещаемым. Существует даже такой термин:
              "Песочница". Новый сайт в поисковых системах сразу попадает в так
              называемую "Песочницу", то есть некоторое время он вообще не
              индексируется и не выдается в результатах запросов пользователей.
              А дальше как повезет: может, через месяц-два-три, и начнут
              приходить пользователи на Ваш сайт, а может и нет... Вот для&nbsp;
              того, чтобы&nbsp; все таки стали приходить, и в большом
              количестве, и существует{' '}
              <strong>поисковое продвижение сайтов.</strong>{' '}
            </p>

            <p>{' '}</p>

            <p>
              <strong>Поисковое продвижение сайтов</strong> - это ряд
              мероприятий, нацеленных на улучшение позиций сайта в результатах
              поисковых запросов пользователей, в результате чего поднимается
              посещаемость сайта.
            </p>

            <p>{' '}</p>

            <p>
              <strong>Поисковое продвижение сайтов</strong> как правило включает
              в себя несколько составляющих:
            </p>

            <p>{' '}</p>

            <ul>
              <li>
                <strong>Аналитика сайта</strong>.<br />
                Очень важно понимать какие услуги будут продвигаться, кто
                целевая аудитория, каков объем рынка, какова конкуренция и т.п.
                Все это позволит более четко представлять общую картину,
                понимать цели, возможности и риски, избежать лишних трат
                или&nbsp; наоборот, не дополучить возможную итоговую прибыль. В
                результате определяемся с тактикой, которая обеспечит
                максимальный эффект за разумные усилия.
                <br />
                <br />
              </li>

              <li>
                <strong>Поисковая оптимизация сайта</strong>.<br />
                <strong>Поисковая оптимизация</strong> - это ряд мер,&nbsp;
                направленных на улучшение сайта с технической и информационной
                точки зрения, что обеспечит более качественное, скорейшее и
                объемное индексирование сайта поисковыми роботами. Существует
                поговорка: "Трудно искать черную кошку в черной комнате,
                особенно когда ее там нет". В нашем случае подразумевается сразу
                два момента:
                <br />
                1) Если мы хотим, чтобы поисковые системы, в ответ на
                определенные запросы, выдовали информацию о&nbsp; нас, нужно
                дать возможность поисковым системам найти эту информацию на
                нашем сайте и в максимально удобной и понятной для поисковых
                роботов форме.
                <br />
                2) Вот если мы первый момент не обеспечиваем, то автоматически
                вытекает второй: люди не найдут информацию о Вас в поисковиках,
                потому что информации о Вас там просто нет...
                <br />
                <br />
              </li>

              <li>
                <strong>
                  Увеличение ссылочной массы сайта.
                  <br />
                </strong>
                Существует правило: чем больше "хороших" сайтов ссылаются на Ваш
                сайт, тем больше индекс&nbsp; доверия поисковых систем к сайту,
                что тоже положительно влияет на позиции сайта в результатах
                выдачи на запросы.
                <br />
                <br />
              </li>

              <li>
                <strong>Статейное продвижение сайта.</strong>
                <br />
                На сегодя становится все более популярным метод статейного
                продвижения сайтов. Принцип прост: Вы платите деньги, а за это
                Вам пишут хорошую статью про Вас&nbsp; и Ваши услуги, и
                размещают на "хороших" сайтах. Хороший PR и вес к сайту.
              </li>
            </ul>

            <p>{' '}</p>

            <p>
              Существует еще не мало методов, применение или&nbsp; не применение
              которых&nbsp; зависит от каждого отдельного случая.
            </p>
          </div>
        </div>

        <div className="clear"></div>
      </div>
    </SearchPromotionPageStyled>
  )
}
