import type * as React from 'react'
import { Link } from 'react-router'
import { FullSupportPageStyled } from './styles'

export const FullSupportPage: React.FC = () => {
  return (
    <FullSupportPageStyled>
      <div className="middle">
        <div className="left_block">
          <div className="menu">
            <ul className="menu">
              <li className="level1">
                <Link to="/" title="Главная страница">
                  Главная
                </Link>
              </li>

              <li className="level1">
                <Link to="/about.html" title="О компании">
                  О компании
                </Link>
              </li>

              <li className="level1 active">
                <Link to="/services.html" title="Услуги">
                  Услуги
                </Link>
                <ul>
                  <li className="level2">
                    <Link
                      to="/services/sozdanie-saitov.html"
                      title="Создание сайтов"
                    >
                      Создание сайтов
                    </Link>
                  </li>

                  <li className="level2">
                    <Link
                      to="/services/poiskovoe-prodvigenie.html"
                      title="Поисковое продвижение сайтов"
                    >
                      Поисковое продвижение
                    </Link>
                  </li>

                  <li className="last level2 active">
                    <Link
                      to="/services/poddergka-prodvigenie.html"
                      title="Поддержка, продвижение сайтов"
                    >
                      Поддержка, продвижение
                    </Link>
                    <ul>
                      <li className="level3 active self">
                        <Link
                          to={
                            '/services/poddergka-prodvigenie/polnaya-poddergka-saytov.html'
                          }
                          title="Полная поддержка сайтов"
                        >
                          Полная поддержка сайтов
                        </Link>
                      </li>

                      <li className="level3">
                        <Link
                          to={
                            '/services/poddergka-prodvigenie/kak-obnovlyat-sait-samomu.html'
                          }
                          title="Как обновлять сайт самому?"
                        >
                          Как обновлять сайт самому?
                        </Link>
                      </li>

                      <li className="last level3">
                        <Link
                          to={
                            '/services/poddergka-prodvigenie/obzor-populyarnyh-cms.html'
                          }
                          title={
                            'Краткий обзор популярных Систем Управления Контентом'
                          }
                        >
                          Обзор популярных CMS
                        </Link>
                      </li>
                    </ul>
                  </li>
                </ul>
              </li>

              <li className="level1">
                <Link to="/portfolio.html" title="Портфолио">
                  Портфолио
                </Link>
              </li>

              <li className="level1">
                <Link to="/documentation.html" title="Документация">
                  Документация
                </Link>
              </li>

              <li className="last level1">
                <Link to="/contacts.html" title="Контактная  информация">
                  Контактная информация
                </Link>
              </li>
            </ul>{' '}
          </div>
        </div>

        <div className="center_block">
          <div className="breadcrumbs">
            <span className="B_crumbBox">
              <span className="B_firstCrumb">
                <Link to="/">Главная</Link>
              </span>{' '}
              »{' '}
              <Link
                className="B_crumb"
                to="/services.html"
                title={
                  'Услуги веб-студии "Новая парадигма". Создание, поддержка и продвижение сайтов'
                }
              >
                Услуги
              </Link>{' '}
              »{' '}
              <Link
                className="B_crumb"
                to="/services/poddergka-prodvigenie.html"
                title="Поддержка, продвижение сайтов"
              >
                Поддержка, продвижение
              </Link>{' '}
              »{' '}
              <h1 className="B_lastCrumb" tabIndex={-1}>
                <span className="B_currentCrumb">Полная поддержка сайтов</span>
              </h1>
            </span>
          </div>

          <div id="content">
            <h2>Сегодняшний интернет и его возможности</h2>

            <p>
              <br />
              Интернет постепенно становится неотъемлемой частью нашей жизни.
              Благодаря развитию информационных технологий, люди получили
              совершенные системы коммуникаций и реальную возможность не выходя
              из дома совершать покупки и вести дела. Теперь Сеть не только
              гигантская информационная среда, но и широкое поле деятельности
              для ведения бизнеса. Не удивительно, что в наши дни каждая
              компания, даже самая маленькая, рано или поздно приходит к
              выводам, что собственный интернет-ресурс это не атрибут,
              указывающий на ее принадлежность к высоким технологиям, а весьма
              эффективный инструмент на рынке продвижения товаров и услуг. Вот
              только не все внимательно изучают инструкцию по его эксплуатации.
              До сих пор некоторые представители малого и среднего бизнеса
              пренебрегают в ущерб себе прописными истинами. <br />
              <br />
            </p>

            <p>
              Интернет стал мощным орудием в успешном ведении бизнеса, он уже
              пережил времена дилетантизма и охотно раскрывается навстречу
              любому человеку, изучившему его правила. Современная виртуальная
              территория совершенствуется с каждым годом, ее покорение требует
              профессиональных навыков и глубоких знаний. <br />
              <br />
            </p>

            <p>
              Начнем с того, что любой сайт, сделанный любителем или новичком,
              при всей внешней респектабельности не будет полноценным. А
              самостоятельная раскрутка, привлекающая первых посетителей,
              окажется по сравнению с полноценным продвижением ресурса — каплей
              в море. <br />
              <br />
            </p>

            <p>
              Для того чтобы подчинить виртуальное пространство и заполучить
              целевую аудиторию не достаточно просто создать собственный или
              корпоративный сайт. Чтобы о нем заговорили, оценили и восприняли
              всерьез необходимо приложить усилия. Популярность в Сети зависит
              от грамотного продвижения интернет-ресурса. Ваш сайт может быть
              великолепен с точки зрения вэб-дизайна и удобства интерфейса, он
              может содержать ценнейшую информацию, но без должной оптимизации,
              без постоянного обновления контента о нем никто не узнает. Тем не
              менее, создание сайта и его последующее продвижение еще не
              конечный этап, обещающий безоговорочный успех. Завоевать высокие
              рейтинги это лишь полдела, главное – удержать завоеванные позиции.
              Весь комплекс мер по поддержанию авторитета вашего ресурса и его
              значимости на просторах интернета кратко и емко принято называть –
              поддержка сайта. <br />
              <br />
            </p>

            <h2>
              Что есть «продвижение сайта»{'   '}
              <br />
              <br />
            </h2>

            <p>
              Создание сайта, его продвижение и поддержка только в совокупности
              обещают стопроцентное попадание в яблочко.&nbsp; Удобнее всего
              заказывать полный пакет услуг в одной вэб-студии, от создания
              сайта до его поддержки.&nbsp; Ведь кто, как не создатель, сможет
              скорректировать работу своего произведения в особо короткие сроки
              и разработать самый оптимальный план продвижения, с учетом того,
              что основные параметры оного будут известны еще в процессе
              написания и оформления сайта. Да и поддерживать ресурс на плаву
              гораздо сподручнее, когда вэб-мастер с самого начала наблюдал
              процесс становления проекта.
            </p>

            <p>{' '}</p>

            <p>
              Таков идеальный подход, но часто вэб-мастерам и оптимизаторам
              приходится работать с готовыми сайтами, которые имеют свою историю
              и какой-то минимальный трафик в Сети. И поэтому, прежде чем
              продумывать программу продвижения, ими проводится полноценный
              аудит сайта и составляется список всех недоработок. <br />
              <br />
            </p>

            <p>
              Продвижение это целый перечень задач, охватить который без
              профессиональной помощи весьма проблематично. Согласно статистике,
              80% пользователей постоянно обращаются к услугам Яндекса, Гугла и
              других всезнаек. Там они черпают сведения, в том числе о
              компаниях, магазинах, товарах, услугах.&nbsp; Добрая половина
              свято верит, что именно на первых страницах поисков размещаются
              самые добропорядочные и проверенные сайты. Следовательно, в ваших
              интересах оказаться в начале списка. <br />
              Правда, ошибочно предполагать, будто продвижение подразумевает
              исключительно оптимизацию сайта под алгоритмы поисковиков. На
              самом деле успех сайта и его посещаемость зависят от многих
              факторов, в том числе и от поддержки.{' '}
            </p>

            <p>{' '}</p>

            <h2>Оптимизация сайта</h2>

            <p>{' '}</p>

            <p>
              Оптимизация сайта под запросы поисковых систем. Алгоритмы
              капризны, требуют бдительного контроля. Сам процесс многотруден.
              Постоянное пополнение ссылочной массы, размещение рекламных статей
              на специальных площадках, организация рекламных компаний в форумах
              и блогах, все это ради повышения рейтинга вашего сайта в
              поисковиках. Этот труд напрямую связан с качеством самого ресурса.
              <br />
              <br />
              Технические характеристики сайта, его юзабилити, не вечны, все
              течет и меняется, а вэб-технологии особенно. То, что смотрелось
              свежо и оригинально лет пять назад, по прошествии времени лишь
              отпугнет часть аудитории старомодностью. Прозорливый владелец
              сайта прекрасно осознает, что его задача заставить ресурс идти в
              ногу со временем, постоянно улучшая навигацию и перенимая
              передовые технологии в области создания сайтов. <br />
              <br />
            </p>

            <h2>Мониторинг сайта</h2>

            <p>{' '}</p>

            <p>
              Мониторинг сайта и его положения в рейтингах, позволяющий
              постоянно держать руку на пульсе и отслеживать занятые или сданные
              позиции, с последующей корректировкой разработанных стратегий. Это
              одна из основных задач, возложенных на процесс поддержки
              сайта.{' '}
            </p>

            <h2>
              <br />
              Обновление контента
            </h2>

            <p>
              <br />
              Интересные тексты, которые должны работать на заинтересованных
              читателей, а не на поисковых роботов.&nbsp; Ведь роль контента в
              интернете велика, печатное слово до сих пор остается его важнейшей
              составляющей. Поэтому автор текстов обязан отслеживать в своей
              работе информативность, читабельность написанного, форматирование
              оного относительно визуального восприятия с монитора, а также
              помнить о ключевых словах и словосочетаниях, рассчитанных на
              поисковики. Это и постоянные обновления информативных статей на
              самом сайте, и сео-копирайтинг, и новости, и пресс-релизы. То есть
              весь спектр текстового материала, направленного на привлечение
              потенциальных пользователей.{' '}
            </p>

            <p>{' '}</p>

            <h2>Аналитика </h2>

            <p>{' '}</p>

            <p>
              Анализ деятельности ваших конкурентов и общего положения дела в
              том рыночном сегменте интернета, где ваш сайт намерен занять
              серьезные позиции. Без этого невозможно обнаружить свободную нишу,
              выбрать ту особенность, которая обозначит ваше превосходство над
              соперниками. <br />
              Поддержка сайта
              <br />
              <br />
            </p>

            <p>
              Постоянное наблюдение за слаженной работой ресурса и его позициями
              в поисковых запросах. Один из основополагающих факторов,
              отвечающих за авторитетность вашего сайта в Сети. Передав в руки
              грамотного администратора дела управления ресурсом, вы обеспечите
              себе гарантию его успешного развития и продвижения в интернете.
            </p>

            <p>{' '}</p>

            <h2>Интернет-маркетинг решит все проблемы</h2>

            <p>{' '}</p>

            <p>
              Все вышеперечисленное, вкупе с последующей поддержкой сайта, смело
              можно назвать интернет-маркетингом. На данном этапе он является
              самым грамотным способом привлечения пользователей, что, с учетом
              огромной аудитории, на которую он направлен, делает его настоящей
              панацеей для вашего бизнеса. Он работает на узнаваемость вашей
              фирмы. Справиться со всеми премудростями маркетинга в Сети
              владельцу ресурса, даже самому теоретически подкованному, весьма
              проблематично. Зато обратившись в веб-студию, которая
              профессионально занимается разработкой сайтов и их поддержкой, вы
              сэкономите свои время и деньги.{' '}
            </p>

            <p>{' '}</p>

            <p>
              Более того, мы предлагаем своим клиентам совершенно бесплатно
              разработать новый сайт или провести реконструкцию старого при
              заключении договора на абонентское обслуживание. Таким способом мы
              бережем не только время клиентов, но и их средства. <br />
              <br />
            </p>

            <p>
              В нашей студии вы найдете полный спектр услуг по завоеванию
              интернет-пространства. У нас всегда можно заказать сайт с нуля,
              который будет создан с учетом последних требований информационных
              технологий. Или обратиться по вопросу оптимизации уже имеющегося
              проекта. Тогда мы проведем глубокий анализ сайта и наметим вместе
              с вами самые короткие пути к потенциальным пользователям. Вверив
              нам продвижение и поддержку ресурса, вы полностью переложите на
              наши плечи все проблемы по выбору верной стратегии и маркетинговой
              политики. Профессионалы сделают любой сайт интересным для
              пользователей, а товары и услуги ? востребованными.
            </p>
          </div>
        </div>

        <div className="clear"></div>
      </div>
    </FullSupportPageStyled>
  )
}
